Repository: Hackder/gcode-parser
Catalog: src/i18n/messages.*.xlf
Languages: sk

# gcodeTemplateLabel
source: GCode template text
sk: GCode predloha

# gcodeTemplateRequired
source: GCode template is required
sk: GCode predloha nemôže byť prázdna

# gcodeNoSemicolon
source: GCode template cannot contain ";"
sk: GCode predloha nemôže obsahovat ";"

# gcodeTemplateExists
source: This GCode template already exists
sk: Táto GCode predloha už existuje

source: Description
sk: Popis

# gcodeTemplateDescriptionPlaceholder
source: Move head to specified...
sk: Nastav teplotu na...

# descriptionRequired
source: Description is required
sk: Popis je povinný

# saveButtonText
source: Save
sk: Uložiť

# deleteButtonText
source: Delete
sk: Zmazať

# openFileButton
source: Open file
sk: Otvoriť súbor

# recentlyOpenedFiles
source: Recently opened
sk: Nedávno otvorené

source: GCode Template
sk: GCode Predloha

# gcodeTemplateSelectionPlaceholder
source: Select GCode Template
sk: Vyber GCode Predlohu

# addNewGCodeInsert
source: Add new
sk: Pridať

# allGCodesHeader
source: All GCodes
sk: Všetky GCode-y

# modificationLocationCreateModal
source: Modification location
sk: Pozícia úpravy

# selectModificationLocationPlaceholder
source: Select modification location
sk: Vyber pozíciu upravy

# modificationLocationRequired
source: Modification location is required
sk: Pozícia úpravy je povinná

source: is required
sk: je povinné

# modificationAlreadyExists
source: Exactly this modification already exists
sk: Presne rovnakáúprava už existuje

# modificationsPageTitle
source: Modifications
sk: Úpravy

# backButton
source: Back
sk: Naspäť

# saveModifiedAsButton
source: Save modified as
sk: Uložiť upravené ako

# addModificationButton
source: Add modification
sk: Pridať úpravu
